<?php
$errortype = array (
        E_ERROR              => 'Ошибка',
        E_WARNING            => 'Предупреждение',
        E_PARSE              => 'Ошибка разбора исходного кода',
        E_NOTICE             => 'Уведомление',
        E_CORE_ERROR         => 'Ошибка ядра',
        E_CORE_WARNING       => 'Предупреждение ядра',
        E_COMPILE_ERROR      => 'Ошибка на этапе компиляции',
        E_COMPILE_WARNING    => 'Предупреждение на этапе компиляции',
        E_USER_ERROR         => 'Пользовательская ошибка',
        E_USER_WARNING       => 'Пользовательское предупреждение',
        E_USER_NOTICE        => 'Пользовательское уведомление',
        E_STRICT             => 'Уведомление времени выполнения',
        E_RECOVERABLE_ERROR  => 'Отлавливаемая фатальная ошибка'
);

?>