			<div class="page-error centered">
				
				<div class="error-symbol">
					<i class="fa-warning"></i>
				</div>
				
				<h2>
					{L_"Ошибка"} 404
					<small>{L_"Страница не найдена, либо нет доступа к данному разделу!"}</small>
				</h2>
				
				<p>{L_"Убедитесь в корректности введенного адреса."}</p>
				<p>{L_"Убедитесь в том, что имеете доступ в данный раздел админ-панели."}</p>
				<p>{L_"Либо обратитесь в службу технической поддержки для устренения неисправности."}</p>
				
			</div>